<template>
  <div class="wrapper">
    <form  novalidate class="form"
      v-on:submit.prevent="sendForm"
    >
      <div class="holder-inputs">
        <input class="input title-fz12 name" type="text" placeholder="Name" name="name">
        <div class="input-img input-img-name">
          <svg version="1.0" xmlns="http://www.w3.org/2000/svg"
            width="512.000000pt" height="512.000000pt" viewBox="0 0 512.000000 512.000000"
            preserveAspectRatio="xMidYMid meet">
            <metadata>
            Created by potrace 1.16, written by Peter Selinger 2001-2019
            </metadata>
            <g transform="translate(0.000000,512.000000) scale(0.100000,-0.100000)"
            fill="rgb(46, 162, 114)" stroke="none">
            <path d="M2265 5109 c-487 -60 -923 -242 -1310 -548 -93 -73 -327 -307 -400
            -400 -299 -380 -482 -816 -540 -1281 -20 -163 -20 -477 0 -640 127 -1031 891
            -1902 1893 -2161 215 -55 337 -71 593 -76 343 -7 572 25 867 123 872 289 1524
            1027 1707 1929 47 230 59 584 30 825 -144 1157 -1068 2081 -2225 2225 -135 16
            -493 19 -615 4z m447 -1103 c99 -30 162 -69 243 -151 124 -123 169 -230 169
            -400 0 -78 -5 -114 -23 -165 -142 -408 -640 -530 -940 -229 -134 135 -195 330
            -158 505 25 117 70 198 162 289 98 99 185 144 325 169 42 7 172 -3 222 -18z
            m100 -1296 c257 -53 460 -163 654 -355 158 -156 250 -303 319 -508 50 -148 65
            -261 65 -477 0 -163 -2 -189 -19 -216 -41 -68 39 -64 -1271 -64 -1310 0 -1230
            -4 -1271 64 -17 27 -19 53 -19 216 0 337 56 541 217 790 68 104 239 277 343
            347 301 202 642 272 982 203z"/>
            <path d="M2464 3760 c-54 -17 -128 -73 -161 -123 -43 -64 -56 -117 -51 -203 8
            -114 65 -200 171 -256 35 -19 58 -23 137 -23 86 0 100 3 148 29 60 33 101 76
            134 139 19 35 23 58 23 137 0 79 -4 102 -23 137 -33 63 -75 106 -134 138 -44
            24 -67 29 -133 32 -44 1 -94 -2 -111 -7z"/>
            <path d="M2369 2464 c-494 -89 -849 -527 -849 -1046 l0 -68 1042 0 1041 0 -6
            118 c-3 64 -13 149 -21 187 -75 354 -326 642 -663 765 -162 58 -373 75 -544
            44z"/>
            </g>
          </svg>
        </div>
        <input class="input title-fz12 email" type="email" placeholder="Email" name="email" >
        <div class="input-img input-img-email">
          <svg version="1.0" xmlns="http://www.w3.org/2000/svg"
          width="512.000000pt" height="512.000000pt" viewBox="0 0 512.000000 512.000000"
          preserveAspectRatio="xMidYMid meet">
          <metadata>
          Created by potrace 1.16, written by Peter Selinger 2001-2019
          </metadata>
          <g transform="translate(0.000000,512.000000) scale(0.100000,-0.100000)"
          fill="rgb(46, 162, 114)" stroke="none">
          <path d="M2380 5113 c-340 -33 -608 -100 -867 -217 -737 -332 -1282 -998
          -1454 -1777 -69 -316 -78 -691 -23 -1008 144 -832 700 -1547 1477 -1897 208
          -95 490 -173 729 -204 56 -8 191 -10 370 -8 233 4 303 9 398 26 510 95 956
          322 1326 675 423 403 691 933 770 1517 19 146 18 525 -1 677 -111 843 -642
          1580 -1410 1958 -236 116 -457 188 -705 229 -188 31 -459 44 -610 29z m1631
          -1420 c35 -19 64 -43 84 -71 l30 -44 0 -1023 0 -1023 -30 -44 c-20 -28 -49
          -52 -84 -70 l-55 -28 -1395 0 c-1335 0 -1398 1 -1437 19 -53 24 -109 91 -123
          146 -15 62 -15 1938 0 2000 14 55 70 122 123 146 39 18 102 19 1437 19 l1395
          0 55 -27z"/>
          <path d="M1410 3516 c8 -8 271 -202 583 -430 l568 -417 32 23 c72 51 1123 821
          1131 829 6 5 -479 9 -1159 9 -1008 0 -1167 -2 -1155 -14z"/>
          <path d="M1182 2518 l3 -933 1374 -3 c1093 -2 1376 0 1383 10 8 14 11 1858 3
          1858 -3 0 -301 -217 -663 -482 -361 -265 -670 -488 -686 -497 -22 -10 -36 -12
          -56 -4 -15 6 -322 226 -681 490 -360 263 -660 482 -667 487 -10 6 -12 -179
          -10 -926z m1085 -411 c28 -27 28 -29 31 -175 2 -126 0 -152 -15 -182 -30 -59
          -48 -61 -481 -58 l-384 3 -29 33 -29 32 0 150 c0 82 4 160 10 174 20 55 29 56
          467 53 l403 -2 27 -28z"/>
          <path d="M1550 1915 l0 -35 280 0 280 0 0 35 0 35 -280 0 -280 0 0 -35z"/>
          </g>
          </svg>
        </div>
        <input class=" input title-fz12 password" type="password" placeholder="Password" name="password">
        <div class="input-img input-img-password">
          <svg version="1.0" xmlns="http://www.w3.org/2000/svg"
          width="512.000000pt" height="512.000000pt" viewBox="0 0 512.000000 512.000000"
          preserveAspectRatio="xMidYMid meet">
          <metadata>
          Created by potrace 1.16, written by Peter Selinger 2001-2019
          </metadata>
          <g transform="translate(0.000000,512.000000) scale(0.100000,-0.100000)"
          fill="rgb(46, 162, 114)" stroke="none">
          <path d="M2310 5113 c-485 -49 -947 -234 -1330 -531 -117 -91 -316 -287 -413
          -407 -279 -346 -461 -750 -539 -1199 -29 -172 -37 -551 -14 -726 43 -322 122
          -581 263 -858 118 -233 256 -424 448 -621 414 -425 923 -678 1525 -757 174
          -22 553 -15 726 15 262 45 485 117 719 232 248 122 448 263 654 464 397 387
          647 864 742 1419 30 174 37 541 15 726 -57 466 -235 898 -525 1270 -92 119
          -287 317 -406 413 -378 305 -820 493 -1295 552 -113 14 -466 19 -570 8z m430
          -978 c318 -64 577 -305 677 -632 26 -87 27 -93 31 -424 l4 -336 62 -5 c127
          -11 242 -90 303 -208 l28 -55 3 -385 c3 -423 0 -464 -52 -600 -91 -244 -297
          -428 -561 -502 -79 -22 -89 -22 -675 -22 -586 0 -596 0 -675 22 -264 74 -470
          258 -561 502 -52 136 -55 177 -52 600 l3 385 32 60 c62 117 173 192 299 203
          l64 5 0 296 c0 383 13 459 104 636 180 350 575 539 966 460z"/>
          <path d="M2395 3976 c-242 -57 -422 -208 -509 -429 -48 -122 -56 -192 -56
          -513 l0 -294 730 0 730 0 0 294 c0 212 -4 315 -14 368 -52 272 -226 471 -484
          556 -96 31 -301 40 -397 18z"/>
          <path d="M1545 2564 c-44 -22 -85 -64 -101 -101 -11 -26 -14 -111 -14 -406 0
          -342 2 -380 20 -453 51 -197 208 -369 404 -440 114 -41 196 -46 761 -42 589 5
          579 3 725 75 104 51 231 178 282 283 64 130 68 160 68 577 0 239 -4 382 -11
          400 -14 38 -56 81 -101 104 -36 18 -72 19 -1020 19 -870 0 -986 -2 -1013 -16z
          m1109 -454 c66 -25 131 -85 158 -148 57 -127 -3 -292 -127 -352 l-45 -22 0
          -54 c0 -66 -21 -111 -55 -120 -66 -17 -105 27 -105 120 l0 54 -45 22 c-124 60
          -184 225 -127 352 41 93 150 166 249 167 23 1 67 -8 97 -19z"/>
          <path d="M2498 1953 c-82 -51 -67 -179 25 -210 100 -34 189 75 138 169 -28 54
          -109 74 -163 41z"/>
          </g>
          </svg>
        </div>
        <modal-attention
        class="modal"
        titleText="Name"
        text="Имя должно содержать только латинкские символы."
      />
      </div>
      <button-wide-green>Create free account</button-wide-green>

  </form>
  </div>
</template>
<script>
export default {
  methods: {
    sendForm() {
      console.log('send')
    }
  }
}
</script>
<style lang="scss" scoped>
  .wrapper {
    padding-right: 10px;
  }
  .holder-inputs {
    position: relative;
    padding-left: 40px;
    margin-top: 30px;
    background: var(--light-gray);
    border-radius: 12px;
  }
  .input {
    display: block;
    padding: 8px 10px 8px 0;
    background: var(--light-gray);
    border: none;
    width: 100%;
    outline: none;
    &:not(:last-child) {
      border-bottom: 1px solid var(--dark-gray);
    }
  }
  .input-img {
    height: 21px;
    width: 21px;
    position: absolute;
    svg {
      width: 100%;
      height: 100%;
      g {
        fill: var(--svg-green)
      }
    }
  }
  .input-img-name {
    top: 6px;
    left: 11px;
  }
  .input-img-email {
    top: 40px;
    left: 11px;
  }
  .input-img-password {
    top: 74px;
    left: 11px;
  }
  .modal {
    top: 0;
  }

</style>